Revit 2027 API
FabricationNetworkChangeService.SetPaletteId Method
 Set the fabrication palette identifier to change the elements to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPaletteId(
	int paletteId
)
Public Sub SetPaletteId (
	paletteId As Integer
)
public:
void SetPaletteId(
	int paletteId
)
member SetPaletteId :
        paletteId : int -> unit
Parameters
paletteId Int32
See Also
Reference
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace